CURRENT PLAN IS SHOWING OTHER CHANGES

# module.aws.aws_ssm_parameter.aws_region will be destroyed
  # (because aws_ssm_parameter.aws_region is not in configuration)
  - resource "aws_ssm_parameter" "aws_region" {
      - arn         = "arn:aws:ssm:us-east-1:712893914485:parameter/production/aws/AC9f951863c83dc61cf94bdc12a12270a5/region" -> null
      - data_type   = "text" -> null
      - description = "Twilio account - account SID by short helpline" -> null
      - id          = "/production/aws/AC9f951863c83dc61cf94bdc12a12270a5/region" -> null
      - key_id      = "alias/aws/ssm" -> null
      - name        = "/production/aws/AC9f951863c83dc61cf94bdc12a12270a5/region" -> null
      - tags        = {
          - "Environment" = "production"
          - "Name"        = "/production/aws/AC9f951863c83dc61cf94bdc12a12270a5/region"
          - "Terraform"   = "true"
        } -> null
      - tags_all    = {
          - "Environment" = "production"
          - "Name"        = "/production/aws/AC9f951863c83dc61cf94bdc12a12270a5/region"
          - "Terraform"   = "true"
        } -> null
      - tier        = "Standard" -> null
      - type        = "SecureString" -> null
      - value       = (sensitive value)
      - version     = 1 -> null
    }

  # module.aws.aws_ssm_parameter.serverless_base_url will be updated in-place
  ~ resource "aws_ssm_parameter" "serverless_base_url" {
        id             = "/production/serverless/AC9f951863c83dc61cf94bdc12a12270a5/base_url"
      + insecure_value = (known after apply)
        name           = "/production/serverless/AC9f951863c83dc61cf94bdc12a12270a5/base_url"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/serverless/AC9f951863c83dc61cf94bdc12a12270a5/base_url"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.github[0].github_actions_secret.webchat_serverless_url must be replaced
-/+ resource "github_actions_secret" "webchat_serverless_url" {
      ~ created_at      = "2023-04-26 16:44:50 +0000 UTC" -> (known after apply)
      ~ id              = "webchat:CA_PROD_SERVERLESS_URL" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-04-26 16:44:50 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.serverless.data.external.service_environment_production will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "service_environment_production" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + "../../serverless/default/getServerlessServiceEnvironmentData.py",
        ]
      + query   = {
          + "environment_sid"    = "ZE56ef3f078fe4b40ad57d4d4f63652210"
          + "service_sid"        = "ZS2035e3023773cf7a1a482950df4f2150"
          + "twilio_account_sid" = (sensitive value)
          + "twilio_auth_token"  = (sensitive value)
        }
      + result  = (known after apply)
    }

  # module.serverless.twilio_serverless_services_v1.serverless will be updated in-place
  ~ resource "twilio_serverless_services_v1" "serverless" {
        id                  = "ZS2035e3023773cf7a1a482950df4f2150"
      ~ ui_editable         = false -> true
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_v1.flex_task_assignment will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_v1" "flex_task_assignment" {
      ~ event_callback_url     = "https://serverless-3836-production.twil.io/webhooks/taskrouterCallback" -> (known after apply)
        id                     = "WSf2e3f00412fa8cc45f4318b45a870ea5"
        # (7 unchanged attributes hidden)
    }
